# Pandas for Data Analysis

**Pandas** is the most popular Python library for data manipulation and analysis. It provides high-performance, easy-to-use data structures and data analysis tools.

**Key Concepts:**
1.  **Series:** A one-dimensional labeled array (like a list or column).
2.  **DataFrame:** A two-dimensional labeled data structure (like a spreadsheet or SQL table).

In this notebook, we will cover:
* Loading and creating data
* Inspecting and cleaning data
* Selecting and filtering
* Statistical aggregation and grouping

In [2]:
import pandas as pd
import numpy as np

# Check version
print(f"Pandas version: {pd.__version__}")

Pandas version: 2.2.3

## 1. Creating DataFrames

While we usually read data from CSV or Excel files, it is important to understand how to create DataFrames from scratch using Python dictionaries.

Here, we will create a mock dataset representing student scores in a statistics class.

In [3]:
data = {
    'Student_ID': [101, 102, 103, 104, 105, 106, 107, 108],
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Frank', 'Grace', 'Hannah'],
    'Age': [20, 21, 19, 22, 20, 23, 19, 21],
    'Gender': ['F', 'M', 'M', 'M', 'F', 'M', 'F', 'F'],
    'Midterm_Score': [85, 78, 92, 60, 88, np.nan, 95, 82],  
    'Final_Score': [90, 80, 85, 65, 92, 70, 98, 85],
    'Attendance_Rate': [0.95, 0.80, 0.90, 0.60, 0.95, 0.50, 1.00, 0.85]
}

df = pd.DataFrame(data)

df

,Student_ID,Name,Age,Gender,Midterm_Score,Final_Score,Attendance_Rate
0,101,Alice,20,F,85.0,90,0.95
1,102,Bob,21,M,78.0,80,0.80
2,103,Charlie,19,M,92.0,85,0.90
3,104,David,22,M,60.0,65,0.60
4,105,Eva,20,F,88.0,92,0.95
5,106,Frank,23,M,NaN,70,0.50
6,107,Grace,19,F,95.0,98,1.00
7,108,Hannah,21,F,82.0,85,0.85

## 2. Inspecting the Data

Before running any statistical analysis, we must understand the structure of our dataset.

* `head(n)`: View the first n rows.
* `info()`: Check data types and missing values.
* `describe()`: Get a statistical summary of numerical columns.
* `shape`: Get the dimensions (rows, columns).

In [4]:
print("--- First 5 Rows ---")
display(df.head())

print("\n--- DataFrame Info ---")
df.info()

print("\n--- Statistical Summary ---")
display(df.describe())

print(f"\nShape of DataFrame: {df.shape}")

--- First 5 Rows ---

,Student_ID,Name,Age,Gender,Midterm_Score,Final_Score,Attendance_Rate
0,101,Alice,20,F,85.0,90,0.95
1,102,Bob,21,M,78.0,80,0.80
2,103,Charlie,19,M,92.0,85,0.90
3,104,David,22,M,60.0,65,0.60
4,105,Eva,20,F,88.0,92,0.95

--- DataFrame Info ---
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Student_ID       8 non-null      int64
 1   Name             8 non-null      object
 2   Age              8 non-null      int64
 3   Gender           8 non-null      object
 4   Midterm_Score    7 non-null      float64
 5   Final_Score      8 non-null      int64
 6   Attendance_Rate  8 non-null      float64
dtypes: float64(2), int64(3), object(2)
memory usage: 580.0+ bytes

--- Statistical Summary ---

       Student_ID        Age  Midterm_Score  Final_Score  Attendance_Rate
count     8.00000   8.000000       7.000000     8.000000          8.00000
mean    104.50000  20.625000      82.857143    83.125000          0.81875
std       2.44949   1.407886      11.610750    11.115465          0.17916
min     101.00000  19.000000      60.000000    65.000000          0.50000
25%     102.75000  19.750000      80.000000    77.500000          0.75000
50%     104.50000  20.500000      85.000000    85.000000          0.87500
75%     106.25000  21.250000      90.000000    90.500000          0.95000
max     108.00000  23.000000      95.000000    98.000000          1.00000

Shape of DataFrame: (8, 7)

## 3. Indexing and Selection

Pandas offers two primary ways to select data:
1.  **`.loc` (Label-based):** Select by column name or row label.
2.  **`.iloc` (Integer-based):** Select by index position (0 to length-1).

In [5]:
ages = df['Age']
print("--- Age Column ---")
print(ages.head(3))

scores = df[['Name', 'Midterm_Score', 'Final_Score']]
print("\n--- Name and Scores ---")
display(scores.head(3))

print("\n--- Using .loc ---")
display(df.loc[0:2, ['Name', 'Attendance_Rate']])

print("\n--- Using .iloc ---")
display(df.iloc[0:3, 0:3])

--- Age Column ---
0    20
1    21
2    19
Name: Age, dtype: int64

--- Name and Scores ---

      Name  Midterm_Score  Final_Score
0    Alice           85.0           90
1      Bob           78.0           80
2  Charlie           92.0           85

--- Using .loc ---

      Name  Attendance_Rate
0    Alice             0.95
1      Bob             0.80
2  Charlie             0.90

--- Using .iloc ---

   Student_ID     Name  Age
0         101    Alice   20
1         102      Bob   21
2         103  Charlie   19

## 4. Filtering Data

In statistics, we often want to study specific subsets of a population. We use **Boolean Indexing** for this.

Syntax: `df[condition]`

In [6]:
older_students = df[df['Age'] > 20]
print("--- Students Older than 20 ---")
display(older_students)


high_scoring_females = df[(df['Gender'] == 'F') & (df['Final_Score'] > 85)]
print("\n--- High Scoring Female Students ---")
display(high_scoring_females)

--- Students Older than 20 ---

   Student_ID    Name  Age Gender  Midterm_Score  Final_Score  Attendance_Rate
1         102     Bob   21      M           78.0           80             0.80
3         104   David   22      M           60.0           65             0.60
5         106   Frank   23      M            NaN           70             0.50
7         108  Hannah   21      F           82.0           85             0.85

--- High Scoring Female Students ---

   Student_ID   Name  Age Gender  Midterm_Score  Final_Score  Attendance_Rate
0         101  Alice   20      F           85.0           90             0.95
4         105    Eva   20      F           88.0           92             0.95
6         107  Grace   19      F           95.0           98             1.00

## 5. Data Cleaning

Real-world data is rarely clean. Missing values (NaN) can ruin statistical models.

* `isnull()`: Detect missing values.
* `dropna()`: Remove rows with missing values.
* `fillna()`: Replace missing values (imputation).

In [7]:
print("Missing values per column:")
print(df.isnull().sum())

df_dropped = df.dropna()
print(f"\nShape after dropping NaNs: {df_dropped.shape}")

midterm_mean = df['Midterm_Score'].mean()
df['Midterm_Score'] = df['Midterm_Score'].fillna(midterm_mean)

print("\nData after filling NaNs:")
display(df)

Missing values per column:
Student_ID         0
Name               0
Age                0
Gender             0
Midterm_Score      1
Final_Score        0
Attendance_Rate    0
dtype: int64

Shape after dropping NaNs: (7, 7)

Data after filling NaNs:

,Student_ID,Name,Age,Gender,Midterm_Score,Final_Score,Attendance_Rate
0,101,Alice,20,F,85.000000,90,0.95
1,102,Bob,21,M,78.000000,80,0.80
2,103,Charlie,19,M,92.000000,85,0.90
3,104,David,22,M,60.000000,65,0.60
4,105,Eva,20,F,88.000000,92,0.95
5,106,Frank,23,M,82.857143,70,0.50
6,107,Grace,19,F,95.000000,98,1.00
7,108,Hannah,21,F,82.000000,85,0.85

## 6. Creating New Columns

We often derive new variables from existing ones. Let's calculate the **Total Score** and check if the student **Passed** (Total > 150).

In [8]:
df['Total_Score'] = df['Midterm_Score'] + df['Final_Score']

df['Passed'] = np.where(df['Total_Score'] >= 150, 'Yes', 'No')

display(df[['Name', 'Total_Score', 'Passed']])

      Name  Total_Score Passed
0    Alice   175.000000    Yes
1      Bob   158.000000    Yes
2  Charlie   177.000000    Yes
3    David   125.000000     No
4      Eva   180.000000    Yes
5    Frank   152.857143    Yes
6    Grace   193.000000    Yes
7   Hannah   167.000000    Yes

## 7. Grouping and Aggregation

This is critical for statistical analysis. We use `.groupby()` to split the data into groups and apply a function (mean, sum, count) to each group.

We can also check the **Correlation Matrix** to see relationships between variables.

In [9]:
gender_group = df.groupby('Gender')[['Midterm_Score', 'Final_Score', 'Attendance_Rate']].mean()
print("--- Average Scores by Gender ---")
display(gender_group)

print("\n--- Pass/Fail Count ---")
print(df['Passed'].value_counts())

print("\n--- Correlation Matrix ---")
correlation = df[['Age', 'Midterm_Score', 'Final_Score', 'Attendance_Rate']].corr()
display(correlation)

--- Average Scores by Gender ---

        Midterm_Score  Final_Score  Attendance_Rate
Gender
F           87.500000        91.25           0.9375
M           78.214286        75.00           0.7000

--- Pass/Fail Count ---
Passed
Yes    7
No     1
Name: count, dtype: int64

--- Correlation Matrix ---

                      Age  Midterm_Score  Final_Score  Attendance_Rate
Age              1.000000      -0.686384    -0.854670        -0.930957
Midterm_Score   -0.686384       1.000000     0.820184         0.664952
Final_Score     -0.854670       0.820184     1.000000         0.945563
Attendance_Rate -0.930957       0.664952     0.945563         1.000000

## 8. Saving the Data

Once we have cleaned and processed the data, we can save it back to a CSV file.

In [10]:
df.to_csv('processed_student_data.csv', index=False)
print("File saved successfully!")

File saved successfully!

## 9. Appendix: Additional Useful Pandas Functions

Here is a quick reference list of other valuable functions you might need for statistical analysis and data manipulation.

### **A. Data Inspection & Information**
| Function | Description |
| :--- | :--- |
| `df.columns` | Returns a list of all column names. |
| `df.dtypes` | Returns the data type of each column. |
| `df.nunique()` | Counts the number of distinct (unique) elements in each column. |
| `df.sample(n)` | Returns a random sample of `n` rows (useful for large datasets). |
| `df.nsmallest(n, 'col')` | Returns the first `n` rows ordered by smallest values in 'col'. |
| `df.nlargest(n, 'col')` | Returns the first `n` rows ordered by largest values in 'col'. |

### **B. Statistical Functions**
| Function | Description |
| :--- | :--- |
| `df.mean()`, `df.median()` | Computes the mean and median of numerical columns. |
| `df.std()`, `df.var()` | Computes standard deviation and variance. |
| `df.min()`, `df.max()` | Returns the minimum and maximum values. |
| `df.skew()` | Returns the unbiased skewness (measure of asymmetry). |
| `df.kurt()` | Returns the unbiased kurtosis (measure of "tailedness"). |
| `df.quantile(q)` | Computes the quantile at `q` (e.g., 0.5 for median, 0.25 for Q1). |
| `df['col'].unique()` | Returns an array of unique values in a specific column. |

### **C. Data Cleaning & Handling**
| Function | Description |
| :--- | :--- |
| `df.duplicated()` | Returns a boolean Series denoting duplicate rows. |
| `df.drop_duplicates()` | Removes duplicate rows. |
| `df.replace(old, new)` | Replaces specific values throughout the DataFrame. |
| `df.astype(dtype)` | Casts a pandas object to a specified dtype (e.g., float to int). |
| `df.rename(columns={...})` | Renames columns based on a dictionary mapping. |

### **D. Advanced Manipulation**
| Function | Description |
| :--- | :--- |
| `df.sort_values(by='col')` | Sorts the DataFrame by the values in a specific column. |
| `df.apply(func)` | Applies a function along an axis of the DataFrame. |
| `pd.concat([df1, df2])` | Concatenates two DataFrames vertically (stacking). |
| `pd.merge(df1, df2)` | Merges (joins) two DataFrames like an SQL JOIN. |
| `df.pivot_table()` | Creates a spreadsheet-style pivot table as a DataFrame. |

## 10. Exercises


### **Exercise 1: Filtering and Sorting**

Using the `df` (Student Data) we created earlier:
1.  Create a new DataFrame called `consistent_students` containing only students with an **Attendance_Rate greater than 0.85**.
2.  Sort this new DataFrame by **Final_Score** in **descending order** (highest score first).
3.  Display the result.


### Exercise 2:Cleaning "Corrupt" Data**

In real-world statistics, sensors or systems often record errors as specific numbers (like `-999` or `-1`) instead of leaving them empty.

**Scenario:** You have temperature data from a sensor. However, the sensor malfunctioned a few times and recorded **-999**.

**Your Tasks:**
1.  Create the DataFrame using the provided dictionary.
2.  **Replace** the value `-999` with `np.nan` (Look at the *Appendix Section C*).
3.  **Fill** the missing values (`NaN`) with the **median** of the Temperature column (not the mean!).
4.  Display the cleaned DataFrame.

In [17]:
sensor_data = {
    'Day': ['Mon', 'Tue', 'Wed', 'Thu', 'Fri', 'Sat', 'Sun'],
    'Temperature': [22.5, 24.1, -999, 23.0, -999, 25.5, 26.0]
}

### **Exercise 3: Grouping and Variability**

In statistics, the **mean** isn't always enough. We often need to know the **spread** (Standard Deviation) or the **middle value** (Median) to understand the data better.

**Scenario:** You have data on employee salaries across different departments.

**Your Tasks:**
1.  Create the DataFrame.
2.  Group the data by **Department**.
3.  Extract the **Salary** column from the groups.
4.  Calculate two separate statistics for each department:
    * The **Median** Salary.
    * The **Standard Deviation (std)** of the Salary (Look at *Appendix Section B*).
5.  Print both results.

In [20]:
employee_data = {
    'Department': ['Sales', 'Tech', 'Sales', 'Tech', 'HR', 'Sales', 'Tech', 'HR'],
    'Employee': ['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H'],
    'Salary': [50000, 80000, 52000, 85000, 60000, 51000, 82000, 59000]
}